In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:*********@localhost:3306/md_water_services

Connecting to 'mysql+pymysql://root:***@localhost:3306/md_water_services'

In [3]:
%%sql

/*Cleaning our data
Bringing up employee data*/

SELECT 
    *
FROM employee;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

56 rows affected.

+----------------------+----------------+---------------+-------+---------------------------+---------------+-----------+----------------+
| assigned_employee_id | employee_name  |  phone_number | email |          address          | province_name | town_name |    position    |
+----------------------+----------------+---------------+-------+---------------------------+---------------+-----------+----------------+
|          0           |  Amara Jengo   | +99637993287  |  None |  36 Pwani Mchangani Road  |     Sokoto    |   Ilanga  | Field Surveyor |
|          1           |  Bello Azibo   | +99643864786  |  None |   129 Ziwa La Kioo Road   |    Kilimani   |   Rural   | Field Surveyor |
|          2           |  Bakari Iniko  | +99222599041  |  None |   18 Mlima Tazama Avenue  |    Hawassa    |   Rural   | Field Surveyor |
|          3           | Malachi Mavuso | +99945849900  |  None |     100 Mogadishu Road    |     Akatsi    |   Lusaka  | Field Surveyor |
|          4           |  Cheche Buhle  | +99381679640  |  None |      1 Savanna Street     |     Akatsi    |   Rural   | Field Surveyor |
|          5           | Zuriel Matembo | +99034075111  |  None |  26 Bahari Ya Faraja Road |    Kilimani   |   Rural   | Field Surveyor |
|          6           |  Deka Osumare  | +99379364631  |  None |    104 Kenyatta Street    |     Akatsi    |   Rural   | Field Surveyor |
|          7           | Lalitha Kaburi | +99681623240  |  None | 145 Sungura Amanpour Road |    Kilimani   |   Rural   | Field Surveyor |
|          8           |  Enitan Zuri   | +99248509202  |  None |      117 Kampala Road     |    Hawassa    |  Zanzibar | Field Surveyor |
|          10          |   Farai Nia    | +99570082739  |  None | 33 Angélique Kidjo Avenue |     Amanzi    |   Dahabu  | Field Surveyor |
+----------------------+----------------+---------------+-------+---------------------------+---------------+-----------+----------------+
Truncated to displaylimit of 10.

In [10]:
%%sql

/*Cleaning our data
Bringing up employee data. For this query, I joined the two names to form one name*/

SELECT 
    employee_name,
    LOWER(REPLACE(employee_name, ' ','.')) AS Joined_name
FROM employee;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

56 rows affected.

+----------------+----------------+
| employee_name  |  Joined_name   |
+----------------+----------------+
|  Amara Jengo   |  amara.jengo   |
|  Bello Azibo   |  bello.azibo   |
|  Bakari Iniko  |  bakari.iniko  |
| Malachi Mavuso | malachi.mavuso |
|  Cheche Buhle  |  cheche.buhle  |
| Zuriel Matembo | zuriel.matembo |
|  Deka Osumare  |  deka.osumare  |
| Lalitha Kaburi | lalitha.kaburi |
|  Enitan Zuri   |  enitan.zuri   |
|   Farai Nia    |   farai.nia    |
+----------------+----------------+
Truncated to displaylimit of 10.

In [11]:
%%sql

/*Here, I add the email address using CONCAT()*/

SELECT 
    employee_name,
    CONCAT(LOWER(REPLACE(employee_name, ' ','.')), '@ndogowater.gov') AS email_address
FROM employee;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

56 rows affected.

+----------------+-------------------------------+
| employee_name  |         email_address         |
+----------------+-------------------------------+
|  Amara Jengo   |   amara.jengo@ndogowater.gov  |
|  Bello Azibo   |   bello.azibo@ndogowater.gov  |
|  Bakari Iniko  |  bakari.iniko@ndogowater.gov  |
| Malachi Mavuso | malachi.mavuso@ndogowater.gov |
|  Cheche Buhle  |  cheche.buhle@ndogowater.gov  |
| Zuriel Matembo | zuriel.matembo@ndogowater.gov |
|  Deka Osumare  |  deka.osumare@ndogowater.gov  |
| Lalitha Kaburi | lalitha.kaburi@ndogowater.gov |
|  Enitan Zuri   |   enitan.zuri@ndogowater.gov  |
|   Farai Nia    |    farai.nia@ndogowater.gov   |
+----------------+-------------------------------+
Truncated to displaylimit of 10.

# Here, I am going to add/update the 'employee' table. I will update the column 'email' because that column has none.

In [14]:
%%sql

/*Updating the column 'email'*/

UPDATE employee
SET email = CONCAT(LOWER(REPLACE(employee_name, ' ','.')), '@ndogowater.gov');

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

56 rows affected.

++
||
++
++

Now lets see if it worked.

In [15]:
%%sql

/*Verifying the update we just did*/

SELECT 
    *
FROM employee;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

56 rows affected.

+----------------------+----------------+---------------+-------------------------------+---------------------------+---------------+-----------+----------------+
| assigned_employee_id | employee_name  |  phone_number |             email             |          address          | province_name | town_name |    position    |
+----------------------+----------------+---------------+-------------------------------+---------------------------+---------------+-----------+----------------+
|          0           |  Amara Jengo   | +99637993287  |   amara.jengo@ndogowater.gov  |  36 Pwani Mchangani Road  |     Sokoto    |   Ilanga  | Field Surveyor |
|          1           |  Bello Azibo   | +99643864786  |   bello.azibo@ndogowater.gov  |   129 Ziwa La Kioo Road   |    Kilimani   |   Rural   | Field Surveyor |
|          2           |  Bakari Iniko  | +99222599041  |  bakari.iniko@ndogowater.gov  |   18 Mlima Tazama Avenue  |    Hawassa    |   Rural   | Field Surveyor |
|          3           | Malachi Mavuso | +99945849900  | malachi.mavuso@ndogowater.gov |     100 Mogadishu Road    |     Akatsi    |   Lusaka  | Field Surveyor |
|          4           |  Cheche Buhle  | +99381679640  |  cheche.buhle@ndogowater.gov  |      1 Savanna Street     |     Akatsi    |   Rural   | Field Surveyor |
|          5           | Zuriel Matembo | +99034075111  | zuriel.matembo@ndogowater.gov |  26 Bahari Ya Faraja Road |    Kilimani   |   Rural   | Field Surveyor |
|          6           |  Deka Osumare  | +99379364631  |  deka.osumare@ndogowater.gov  |    104 Kenyatta Street    |     Akatsi    |   Rural   | Field Surveyor |
|          7           | Lalitha Kaburi | +99681623240  | lalitha.kaburi@ndogowater.gov | 145 Sungura Amanpour Road |    Kilimani   |   Rural   | Field Surveyor |
|          8           |  Enitan Zuri   | +99248509202  |   enitan.zuri@ndogowater.gov  |      117 Kampala Road     |    Hawassa    |  Zanzibar | Field Surveyor |
|          10          |   Farai Nia    | +99570082739  |    farai.nia@ndogowater.gov   | 33 Angélique Kidjo Avenue |     Amanzi    |   Dahabu  | Field Surveyor |
+----------------------+----------------+---------------+-------------------------------+---------------------------+---------------+-----------+----------------+
Truncated to displaylimit of 10.

It worked. 
Now we are checking to see the length of the phone_number column.

In [18]:
%%sql 

SELECT 
    phone_number,
    LENGTH(phone_number)
FROM employee;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

56 rows affected.

+---------------+----------------------+
|  phone_number | LENGTH(phone_number) |
+---------------+----------------------+
| +99637993287  |          13          |
| +99643864786  |          13          |
| +99222599041  |          13          |
| +99945849900  |          13          |
| +99381679640  |          13          |
| +99034075111  |          13          |
| +99379364631  |          13          |
| +99681623240  |          13          |
| +99248509202  |          13          |
| +99570082739  |          13          |
+---------------+----------------------+
Truncated to displaylimit of 10.

This shows that there are some additional spaces added to the phone number column, let's get ride of it. 
We will use TRIM() to do that

In [21]:
%%sql 

SELECT 
    TRIM(phone_number) AS Trimmed_Phone_number,
    LENGTH(TRIM(phone_number)) AS Lenght_of_New_number
FROM employee;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

56 rows affected.

+----------------------+----------------------+
| Trimmed_Phone_number | Lenght_of_New_number |
+----------------------+----------------------+
|     +99637993287     |          12          |
|     +99643864786     |          12          |
|     +99222599041     |          12          |
|     +99945849900     |          12          |
|     +99381679640     |          12          |
|     +99034075111     |          12          |
|     +99379364631     |          12          |
|     +99681623240     |          12          |
|     +99248509202     |          12          |
|     +99570082739     |          12          |
+----------------------+----------------------+
Truncated to displaylimit of 10.

Now we update the phone_number column of the 'employee' table

In [23]:
%%sql

UPDATE
    employee
SET
    phone_number=TRIM(phone_number);

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

56 rows affected.

++
||
++
++

In [28]:
%%sql 


SELECT 
phone_number,
LENGTH(phone_number)
FROM 
employee;

-- verifying our results

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

56 rows affected.

++
||
++
++

Counting the total number of employees by town

In [76]:
%%sql

select
 town_name,
count( town_name) AS Total_Count_of_employees
FROM
 md_water_services.employee
 group by town_name;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

9 rows affected.

+-----------+--------------------------+
| town_name | Total_Count_of_employees |
+-----------+--------------------------+
|   Ilanga  |            3             |
|   Rural   |            29            |
|   Lusaka  |            4             |
|  Zanzibar |            4             |
|   Dahabu  |            6             |
|  Kintampo |            1             |
|   Harare  |            5             |
|  Yaounde  |            1             |
|   Serowe  |            3             |
+-----------+--------------------------+

Now the team wants to award employees who visited more places. Let's write a query to that effect

In [32]:
%%sql

SELECT 
    assigned_employee_id,
    COUNT(assigned_employee_id) AS TOTAL_VISITS
FROM 
    visits
GROUP BY assigned_employee_id
ORDER BY COUNT(assigned_employee_id) DESC
limit 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+----------------------+--------------+
| assigned_employee_id | TOTAL_VISITS |
+----------------------+--------------+
|          1           |     3708     |
|          30          |     3676     |
|          34          |     3539     |
+----------------------+--------------+

Now, we write a query to identify the data of employees with the above ID's

In [33]:
%%sql 
select
	*
FROM 
	md_water_services.employee
Where assigned_employee_id IN (1,30,34);

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+----------------------+---------------+--------------+----------------------------+-----------------------+---------------+-----------+----------------+
| assigned_employee_id | employee_name | phone_number |           email            |        address        | province_name | town_name |    position    |
+----------------------+---------------+--------------+----------------------------+-----------------------+---------------+-----------+----------------+
|          1           |  Bello Azibo  | +99643864786 | bello.azibo@ndogowater.gov | 129 Ziwa La Kioo Road |    Kilimani   |   Rural   | Field Surveyor |
|          30          |   Pili Zola   | +99822478933 |  pili.zola@ndogowater.gov  |  46 Stone Town Street |    Hawassa    |  Zanzibar | Field Surveyor |
|          34          |   Rudo Imani  | +99046972648 | rudo.imani@ndogowater.gov  | 15 Lake Malawi Avenue |    Kilimani   |   Ilanga  | Field Surveyor |
+----------------------+---------------+--------------+----------------------------+-----------------------+---------------+-----------+----------------+

# Analysing locations

In [34]:
%%sql
/* Records per Town*/

SELECT 
	town_name,
    COUNT(town_name) AS Records_per_town
FROM location
Group BY town_name
ORDER BY  COUNT(town_name) DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

25 rows affected.

+-----------+------------------+
| town_name | Records_per_town |
+-----------+------------------+
|   Rural   |      23740       |
|   Harare  |       1650       |
|   Amina   |       1090       |
|   Lusaka  |       1070       |
|   Mrembo  |       990        |
|   Asmara  |       930        |
|   Dahabu  |       930        |
|  Kintampo |       780        |
|   Ilanga  |       780        |
|  Isiqalo  |       770        |
+-----------+------------------+
Truncated to displaylimit of 10.

In [35]:
%%sql
/* Records per Province*/

SELECT 
	province_name,
    COUNT(province_name) AS Records_per_Province
FROM location
Group BY province_name
ORDER BY  COUNT(province_name) DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+---------------+----------------------+
| province_name | Records_per_Province |
+---------------+----------------------+
|    Kilimani   |         9510         |
|     Akatsi    |         8940         |
|     Sokoto    |         8220         |
|     Amanzi    |         6950         |
|    Hawassa    |         6030         |
+---------------+----------------------+

In [38]:
%%sql

/* Sorting data and grouping them*/

SELECT 
    province_name,
    town_name,
    COUNT(town_name) AS records_per_town
FROM location
GROUP BY province_name, town_name
ORDER BY province_name ASC, records_per_town DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

31 rows affected.

+---------------+-----------+------------------+
| province_name | town_name | records_per_town |
+---------------+-----------+------------------+
|     Akatsi    |   Rural   |       6290       |
|     Akatsi    |   Lusaka  |       1070       |
|     Akatsi    |   Harare  |       800        |
|     Akatsi    |  Kintampo |       780        |
|     Amanzi    |   Rural   |       3100       |
|     Amanzi    |   Asmara  |       930        |
|     Amanzi    |   Dahabu  |       930        |
|     Amanzi    |   Amina   |       670        |
|     Amanzi    |   Pwani   |       520        |
|     Amanzi    |  Abidjan  |       400        |
+---------------+-----------+------------------+
Truncated to displaylimit of 10.

Now lets have a locations count

In [47]:
%%sql


SELECT 
	location_type,
    COUNT(location_type) AS num_sources
FROM 
	location
group by location_type;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2 rows affected.

+---------------+-------------+
| location_type | num_sources |
+---------------+-------------+
|     Urban     |    15910    |
|     Rural     |    23740    |
+---------------+-------------+

In [53]:
%%sql
/* We added a column for percentage*/

SELECT
    location_type,
    COUNT(location_type) AS num_sources,
    ROUND(COUNT(location_type) * 100.0 / SUM(COUNT(location_type)) OVER ()) AS percentage
FROM
    location
GROUP BY location_type;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2 rows affected.

+---------------+-------------+------------+
| location_type | num_sources | percentage |
+---------------+-------------+------------+
|     Urban     |    15910    |     40     |
|     Rural     |    23740    |     60     |
+---------------+-------------+------------+

# Diving into water sources

Question - . How many wells, taps and rivers are there?

In [54]:
%%sql

SELECT
	type_of_water_source,
    COUNT(type_of_water_source) AS 'Totals of water sources'
FROM
	water_source
GROUP BY type_of_water_source
order by COUNT(type_of_water_source) DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+----------------------+-------------------------+
| type_of_water_source | Totals of water sources |
+----------------------+-------------------------+
|         well         |          17383          |
|     tap_in_home      |           7265          |
|  tap_in_home_broken  |           5856          |
|      shared_tap      |           5767          |
|        river         |           3379          |
+----------------------+-------------------------+

Q: What is the average number of people that are served by each water source? Remember to make the numbers easy to
read

In [55]:
%%sql

SELECT
	type_of_water_source,
    COUNT(type_of_water_source) AS 'Totals of water sources',
    ROUND(AVG(number_of_people_served)) AS 'AVG No. of People Served' 
FROM
	water_source
GROUP BY type_of_water_source
order by COUNT(type_of_water_source) DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+----------------------+-------------------------+--------------------------+
| type_of_water_source | Totals of water sources | AVG No. of People Served |
+----------------------+-------------------------+--------------------------+
|         well         |          17383          |           279            |
|     tap_in_home      |           7265          |           644            |
|  tap_in_home_broken  |           5856          |           649            |
|      shared_tap      |           5767          |           2071           |
|        river         |           3379          |           699            |
+----------------------+-------------------------+--------------------------+

 Calculating the total number of people served by each type of water source in total

In [56]:
%%sql

SELECT
	type_of_water_source,
    SUM(number_of_people_served) AS 'Polulation served'
FROM
	water_source
GROUP BY type_of_water_source
order by SUM(number_of_people_served) DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+----------------------+-------------------+
| type_of_water_source | Polulation served |
+----------------------+-------------------+
|      shared_tap      |      11945272     |
|         well         |      4841724      |
|     tap_in_home      |      4678880      |
|  tap_in_home_broken  |      3799720      |
|        river         |      2362544      |
+----------------------+-------------------+

In [64]:
 %%sql
/* Finding the percentages*/
    
SELECT
    type_of_water_source,
    round((SUM(number_of_people_served) / 27628140) * 100)  AS "% Population Served"
FROM
    water_source
GROUP BY type_of_water_source
ORDER BY 
	 round((SUM(number_of_people_served) / 27628140) * 100) 
 DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+----------------------+---------------------+
| type_of_water_source | % Population Served |
+----------------------+---------------------+
|      shared_tap      |          43         |
|         well         |          18         |
|     tap_in_home      |          17         |
|  tap_in_home_broken  |          14         |
|        river         |          9          |
+----------------------+---------------------+

# Start of a solution

Ranking them

In [79]:
%%sql


SELECT
    type_of_water_source,
    SUM(number_of_people_served) AS 'Population Served',
    RANK() OVER (ORDER BY SUM(number_of_people_served) DESC ) AS 'Population Served Rank'
FROM
    water_source
WHERE type_of_water_source != 'tap_in_home'
GROUP BY type_of_water_source
ORDER BY SUM(number_of_people_served) DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

4 rows affected.

+----------------------+-------------------+------------------------+
| type_of_water_source | Population Served | Population Served Rank |
+----------------------+-------------------+------------------------+
|      shared_tap      |      11945272     |           1            |
|         well         |      4841724      |           2            |
|  tap_in_home_broken  |      3799720      |           3            |
|        river         |      2362544      |           4            |
+----------------------+-------------------+------------------------+

Ranking the various types of water source, eliminating tap_in_home

In [82]:
%%sql

SELECT *,
RANK() over (PARTITION BY type_of_water_source ORDER BY number_of_people_served DESC) AS Priority_rank,
DENSE_RANK ()  over (PARTITION BY type_of_water_source order by number_of_people_served DESC) AS Priority_Dense_rank
FROM md_water_services.water_source
WHERE type_of_water_source != 'tap_in_home';

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

32385 rows affected.

+--------------+----------------------+-------------------------+---------------+---------------------+
|  source_id   | type_of_water_source | number_of_people_served | Priority_rank | Priority_Dense_rank |
+--------------+----------------------+-------------------------+---------------+---------------------+
| SoRu34798224 |        river         |           998           |       1       |          1          |
| SoRu35837224 |        river         |           998           |       1       |          1          |
| SoRu36238224 |        river         |           998           |       1       |          1          |
| SoRu36791224 |        river         |           998           |       1       |          1          |
| SoRu36880224 |        river         |           998           |       1       |          1          |
| SoRu38142224 |        river         |           998           |       1       |          1          |
| SoRu37756224 |        river         |           998           |       1       |          1          |
| SoMa33775224 |        river         |           998           |       1       |          1          |
| KiRu30353224 |        river         |           998           |       1       |          1          |
| SoIl32972224 |        river         |           998           |       1       |          1          |
+--------------+----------------------+-------------------------+---------------+---------------------+
Truncated to displaylimit of 10.

# Analysing Queues

In [84]:
%%sql
/* Survery_Duration*/

SELECT
	timestampdiff(day, min(time_of_record), max(time_of_record)) AS Survery_Duration_Days
FROM 
	md_water_services.visits;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+-----------------------+
| Survery_Duration_Days |
+-----------------------+
|          924          |
+-----------------------+

In [85]:
%%sql
/* QUEUE TIME*/

SELECT 
 ROUND(AVG(NULLIF(time_in_queue,0))) AS Queue_Time
FROM 
	md_water_services.visits

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+------------+
| Queue_Time |
+------------+
|    123     |
+------------+

Queue times aggregated

In [88]:
%%sql

/* Queue times aggregated*/

SELECT 
 dayname(time_of_record) AS day_of_week, 
 ROUND(AVG(NULLIF(time_in_queue,0))) AS avg_queue_time
FROM 
	md_water_services.visits
group by dayname(time_of_record)
order by avg_queue_time DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

7 rows affected.

+-------------+----------------+
| day_of_week | avg_queue_time |
+-------------+----------------+
|   Saturday  |      246       |
|    Monday   |      137       |
|    Friday   |      120       |
|   Tuesday   |      108       |
|   Thursday  |      105       |
|  Wednesday  |       97       |
|    Sunday   |       82       |
+-------------+----------------+

Looking at the Hour of the day that people spend so much time at the water_source

In [89]:
%%sql

SELECT 
 Hour(time_of_record) AS Hour_of_day, 
 ROUND(AVG(NULLIF(time_in_queue,0))) AS avg_queue_time
FROM 
	md_water_services.visits
group by Hour(time_of_record)
order by Hour(time_of_record);

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

14 rows affected.

+-------------+----------------+
| Hour_of_day | avg_queue_time |
+-------------+----------------+
|      6      |      149       |
|      7      |      149       |
|      8      |      149       |
|      9      |      118       |
|      10     |      114       |
|      11     |      111       |
|      12     |      112       |
|      13     |      115       |
|      14     |      114       |
|      15     |      114       |
+-------------+----------------+
Truncated to displaylimit of 10.

Hour of the day made simple

In [99]:
%%sql

/*The query indicates the hour of the day that has the longest avg queue*/

SELECT 
 time(time_of_record) AS Hour_of_day, 
 ROUND(AVG(NULLIF(time_in_queue,0))) AS avg_queue_time
FROM 
	md_water_services.visits
group by time(time_of_record)
order by  ROUND(AVG(NULLIF(time_in_queue,0))) desc;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

781 rows affected.

+-------------+----------------+
| Hour_of_day | avg_queue_time |
+-------------+----------------+
|   17:57:00  |      210       |
|   6:42:00   |      209       |
|   8:20:00   |      205       |
|   17:47:00  |      205       |
|   17:22:00  |      197       |
|   6:53:00   |      194       |
|   18:15:00  |      191       |
|   6:49:00   |      190       |
|   7:51:00   |      190       |
|   17:36:00  |      189       |
+-------------+----------------+
Truncated to displaylimit of 10.

Better alternative for the Hour of the day

In [94]:
%%sql 

SELECT 
    TIME_FORMAT(time_of_record, '%H:%i') AS Hour_of_day, 
    ROUND(AVG(NULLIF(time_in_queue, 0))) AS avg_queue_time
FROM 
    md_water_services.visits
GROUP BY TIME_FORMAT(time_of_record, '%H:%i')
ORDER BY TIME_FORMAT(time_of_record, '%H:%i') ASC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

781 rows affected.

+-------------+----------------+
| Hour_of_day | avg_queue_time |
+-------------+----------------+
|    06:00    |      129       |
|    06:01    |      157       |
|    06:02    |      155       |
|    06:03    |      143       |
|    06:04    |      154       |
|    06:05    |      150       |
|    06:06    |      172       |
|    06:07    |      116       |
|    06:08    |      142       |
|    06:09    |      123       |
+-------------+----------------+
Truncated to displaylimit of 10.

Queue times for each hour of each day

In [97]:
%%sql

SELECT
    TIME_FORMAT(TIME(time_of_record), '%H:00') AS hour_of_day,
    -- Sunday
    ROUND(AVG(
        CASE
            WHEN DAYNAME(time_of_record) = 'Sunday' THEN time_in_queue
            ELSE NULL
        END
    ), 0) AS Sunday,
    -- Monday
    ROUND(AVG(
        CASE
            WHEN DAYNAME(time_of_record) = 'Monday' THEN time_in_queue
            ELSE NULL
        END
    ), 0) AS Monday,
    -- Tuesday
    ROUND(AVG(
        CASE
            WHEN DAYNAME(time_of_record) = 'Tuesday' THEN time_in_queue
            ELSE NULL
        END
    ), 0) AS Tuesday,
    -- Wednesday
    ROUND(AVG(
        CASE
            WHEN DAYNAME(time_of_record) = 'Wednesday' THEN time_in_queue
            ELSE NULL
        END
    ), 0) AS Wednesday,
    -- Thursday
    ROUND(AVG(
        CASE
            WHEN DAYNAME(time_of_record) = 'Thursday' THEN time_in_queue
            ELSE NULL
        END
    ), 0) AS Thursday,
    -- Friday
    ROUND(AVG(
        CASE
            WHEN DAYNAME(time_of_record) = 'Friday' THEN time_in_queue
            ELSE NULL
        END
    ), 0) AS Friday,
    -- Saturday
    ROUND(AVG(
        CASE
            WHEN DAYNAME(time_of_record) = 'Saturday' THEN time_in_queue
            ELSE NULL
        END
    ), 0) AS Saturday
FROM
    visits
WHERE
    time_in_queue != 0 -- this excludes other sources with 0 queue times
GROUP BY
    hour_of_day
ORDER BY
    hour_of_day;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

14 rows affected.

+-------------+--------+--------+---------+-----------+----------+--------+----------+
| hour_of_day | Sunday | Monday | Tuesday | Wednesday | Thursday | Friday | Saturday |
+-------------+--------+--------+---------+-----------+----------+--------+----------+
|    06:00    |   79   |  190   |   134   |    112    |   134    |  153   |   247    |
|    07:00    |   82   |  186   |   128   |    111    |   139    |  156   |   247    |
|    08:00    |   86   |  183   |   130   |    119    |   129    |  153   |   247    |
|    09:00    |   84   |  127   |   105   |     94    |    99    |  107   |   252    |
|    10:00    |   83   |  119   |    99   |     89    |    95    |  112   |   259    |
|    11:00    |   78   |  115   |   102   |     86    |    99    |  104   |   236    |
|    12:00    |   78   |  115   |    97   |     88    |    96    |  109   |   239    |
|    13:00    |   81   |  122   |    97   |     98    |   101    |  115   |   242    |
|    14:00    |   83   |  127   |   104   |     92    |    96    |  110   |   244    |
|    15:00    |   83   |  126   |   104   |     88    |    92    |  110   |   248    |
+-------------+--------+--------+---------+-----------+----------+--------+----------+
Truncated to displaylimit of 10.